In [ ]:
import pandas as pd

## CASAMENTO LGBT

In [61]:
lgbt = pd.read_csv('same-sex-marriage-recognition.csv')

In [62]:
lgbt.head(4)

           Entity Code  Year  Same sex marriage and civil unions legal
0     Afghanistan  AFG  2019  Same-sex marriage not legally recognized
1         Albania  ALB  2019  Same-sex marriage not legally recognized
2         Algeria  DZA  2019  Same-sex marriage not legally recognized
3  American Samoa  ASM  2019  Same-sex marriage not legally recognized

In [63]:
lgbt.columns = ['pais', 'codigo_pais', 'ano', 'tipo_casamento']

In [64]:
lgbt.columns

Index(['pais', 'codigo_pais', 'ano', 'tipo_casamento'], dtype='object')

In [65]:
lgbt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 224 entries, 0 to 223
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   pais            224 non-null    object
 1   codigo_pais     221 non-null    object
 2   ano             224 non-null    int64
 3   tipo_casamento  224 non-null    object
dtypes: int64(1), object(3)
memory usage: 7.1+ KB

## POPULACAO
fonte dos dados: https://data.worldbank.org/indicator/SP.POP.TOTL

In [66]:
pop = pd.read_csv('API_SP.POP.TOTL_DS2_en_csv_v2_2918012.csv', skiprows = 3)

In [67]:
pop.head(4)

                  Country Name Country Code  ...         2020 Unnamed: 65
0                        Aruba          ABW  ...     106766.0         NaN
1  Africa Eastern and Southern          AFE  ...  677243299.0         NaN
2                  Afghanistan          AFG  ...   38928341.0         NaN
3   Africa Western and Central          AFW  ...  458803476.0         NaN

[4 rows x 66 columns]

In [68]:
pop['Indicator Name'].unique()

array(['Population, total'], dtype=object)

In [99]:
pop = pop.rename(columns={"Country Name": "pais", "Country Code": "codigo_pais", "2019" : "populacao"})

In [100]:
pop.columns

Index(['pais', 'codigo_pais', 'populacao'], dtype='object')

In [101]:
pop = pop[['pais', 'codigo_pais', 'populacao']]

In [102]:
pop.head(4)

                          pais codigo_pais    populacao
0                        Aruba         ABW     106310.0
1  Africa Eastern and Southern         AFE  660046272.0
2                  Afghanistan         AFG   38041757.0
3   Africa Western and Central         AFW  446911598.0

In [103]:
pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 266 entries, 0 to 265
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pais         266 non-null    object
 1   codigo_pais  266 non-null    object
 2   populacao    264 non-null    float64
dtypes: float64(1), object(2)
memory usage: 6.4+ KB

## MERGE

#### Quantas pessoas vivem em países com o casamento legalizado em 2019? E quantas não vivem?

In [110]:
lgbt['codigo_pais'] = lgbt['codigo_pais'].astype(str)
pop['codigo_pais'] = pop['codigo_pais'].astype(str)

In [126]:
# vamos filtrar por 2019 pois assim teremos apenas os dados mais recentes
# ja que queremos saber quantas pessoas vivem em paises com casamento lgbt
# nao estou conseguindo filtrar.....
lgbt_2019 = lgbt.query['ano == 2019']

SyntaxError: ignored

In [128]:
lgbt_pop = pd.merge(lgbt, pop, how = 'left', on = 'codigo_pais')

In [106]:
lgbt_pop.head(4)

           pais_x codigo_pais  ...          pais_y   populacao
0     Afghanistan         AFG  ...     Afghanistan  38041757.0
1         Albania         ALB  ...         Albania   2854191.0
2         Algeria         DZA  ...         Algeria  43053054.0
3  American Samoa         ASM  ...  American Samoa     55312.0

[4 rows x 6 columns]

In [107]:
lgbt_pop.tail(4)

             pais_x codigo_pais  ...       pais_y   populacao
220  Western Sahara         ESH  ...          NaN         NaN
221           Yemen         YEM  ...  Yemen, Rep.  29161922.0
222          Zambia         ZMB  ...       Zambia  17861034.0
223        Zimbabwe         ZWE  ...     Zimbabwe  14645473.0

[4 rows x 6 columns]

In [108]:
# paises com NA na 'populacao' ou NA no 'codigo_pais'
# nao serao considerados no calculo
erro = lgbt_pop.query('populacao.isnull()', engine='python')

In [109]:
erro

                          pais_x codigo_pais  ...   pais_y populacao
39               Channel Islands    OWID_CIS  ...      NaN       NaN
61                       Eritrea         ERI  ...  Eritrea       NaN
69                 French Guiana         GUF  ...      NaN       NaN
71   French Southern Territories         ATF  ...      NaN       NaN
105                       Kosovo    OWID_KOS  ...      NaN       NaN
147             Northern Ireland         nan  ...      NaN       NaN
174                     Scotland         nan  ...      NaN       NaN
195                       Taiwan         TWN  ...      NaN       NaN
219                    West Bank         nan  ...      NaN       NaN
220               Western Sahara         ESH  ...      NaN       NaN

[10 rows x 6 columns]

In [129]:
lgbt_pop.groupby('pais_x').sum()

                 ano   populacao
pais_x
Afghanistan     2019  38041757.0
Albania         2019   2854191.0
Algeria         2019  43053054.0
American Samoa  2019     55312.0
Andorra         2005     77146.0
...              ...         ...
West Bank       2019         0.0
Western Sahara  2019         0.0
Yemen           2019  29161922.0
Zambia          2019  17861034.0
Zimbabwe        2019  14645473.0

[224 rows x 2 columns]